tutorials/incompressible/pimpleFoam/RAS/waveSubSurface/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1;

libs
(
    "libwaves.so"
);

functions
{
   readG
   {
       libs ("libutilityFunctionObjects.so");
       type coded;
       name readG;
       enabled yes;
       executeControl none;
       codeRead
       #{
           if (!mesh().template foundObject<uniformDimensionedVectorField>("g"))
           {
               Info<< "\nReading g" << endl;
               uniformDimensionedVectorField* g =
                   new uniformDimensionedVectorField
                   (
                       IOobject
                       (
                           "g",
                           mesh().time().constant(),
                           mesh(),
                           IOobject::MUST_READ,
                           IOobject::NO_WRITE
                       )
                   );
               g->store();
           }
       #};
   }
};

// ************************************************************************* //
